Tester/src/Documents/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Job</name>
  <posting>Deny</posting>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>IgnoreCompletion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Mode</name>
    <type>
      <types>EnumRef.Running</types>
    </type>
  </attributes>
  <attributes>
    <name>Parameters</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Scenarios</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
    <attributes>
      <name>Scenario</name>
      <type>
        <types>CatalogRef.Scenarios</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Tester/src/InformationRegisters/Jobs/Jobs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Jobs</name>
  <resources>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Computer</name>
    <type>
      <types>CatalogRef.Computers</types>
    </type>
  </resources>
  <resources>
    <name>Created</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/AgentJobs/AgentJobs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AgentJobs</name>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Finished</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </resources>
  <resources>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Started</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.JobStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Enums/JobStatuses/JobStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>JobStatuses</name>
  <enumValues>
    <name>Fault</name>
  </enumValues>
  <enumValues>
    <name>Passed</name>
  </enumValues>
  <enumValues>
    <name>Pending</name>
  </enumValues>
  <enumValues>
    <name>Removed</name>
  </enumValues>
  <enumValues>
    <name>Running</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Enums/Running/Running.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Running</name>
  <enumValues>
    <name>Now</name>
  </enumValues>
  <enumValues>
    <name>Schedule</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Documents/Job/ObjectModule.bsl
var IsNew;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkAgent () ) then
		Cancel = true;
		return;
	endif;
	
EndProcedure

Function checkAgent ()
	
	if ( Agent.IsEmpty () ) then
		return true;
	endif;
	s = "
	|select top 1 1
	|from Catalog.Users.Managers as Managers
	|where Managers.Ref = &Agent
	|and Managers.Ref.Agent
	|and Managers.User = &Creator
	|and not Managers.Ref.DeletionMark
	|";
	q = new Query ( s );
	q.SetParameter ( "Agent", Agent );
	q.SetParameter ( "Creator", Creator );
	error = q.Execute ().IsEmpty ();
	if ( error ) then
		Output.AgentAccessDenied ( new Structure ( "Creator", Creator ), "Agent" );
	endif;
	return not error;
	
EndFunction

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	IsNew = IsNew ();
	SetPrivilegedMode ( true );
	if ( DeletionMark ) then
		remove ();
		return;
	endif;
	if ( IsNew ) then
		defaultScenario ();
	endif;
	adjustSchedule ();
	
EndProcedure

Procedure remove ()
	
	r = InformationRegisters.Jobs.CreateRecordManager ();
	r.Job = Ref;
	r.Delete ();
	r = InformationRegisters.AgentJobs.CreateRecordManager ();
	r.Job = Ref;
	r.Read ();
	r.Job = Ref;
	r.Status = Enums.JobStatuses.Removed;
	r.Write ();
	if ( Mode = Enums.Running.Schedule ) then
		Jobs.Remove ( Ref );
	endif;

EndProcedure

Procedure defaultScenario ()
	
	table = Scenarios;
	if ( table.Count () = 0 ) then
		Scenario = undefined;
	else
		Scenario = table [ 0 ].Scenario;
	endif;

EndProcedure

Procedure adjustSchedule ()
	
	if ( Mode = Enums.Running.Now ) then
		Schedule = undefined;
	endif;
	
EndProcedure

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	if ( DeletionMark ) then
		return;
	endif;
	if ( Mode = Enums.Running.Now ) then
		if ( IsNew ) then
			TesterAgent.Create ( Ref, Agent, Date, Computer );
		endif;
	else
		initJob ();
	endif;
	
EndProcedure

Procedure initJob ()
	
	var task;
	
	if ( not IsNew ) then
		task = Jobs.GetScheduled ( Ref );
	endif;
	if ( task = undefined ) then
		task = ScheduledJobs.CreateScheduledJob ( Metadata.ScheduledJobs.Testing );
	endif;
	task.Use = true;
	task.UserName = UserName ();
	task.Key = Ref;
	p = new Array ();
	p.Add ( Ref );
	task.Parameters = p;
	task.Schedule = Conversion.JSONToObject ( Schedule, Type ( "JobSchedule" ) );
	task.Write ();
	
EndProcedure
